Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ངག་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱའོ་ཞེས་གཞོན་ནུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བསླབ་པར་བྱའོ། །གཞོན་ནུ་ངག་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ངན་སོང་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་ཤིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་འཐོབ་པར་འགྱུར་རོ།
en: Then the Bhagavān said to Candraprabha, “Young man, you should train by thinking, ‘I will engage in completely pure conduct of speech in that way.’ Young man, bodhisattva mahāsattvas who have the restraint of speech have no fear of any lower realm and obtain the entire Dharma of the buddhas.

source: །སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཐམས་ཅད་དང་། མངོན་པར་ཤེས་པ་ཐམས་ཅད་ཀྱང་ཐོབ་པར་གྱུར་ཏེ། གཞོན་ནུ་དེ་ནི་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: They attain all the miraculous powers and higher cognitions of the buddhas. Young man, that is the restraint of speech.” Thereupon the Bhagavān recited these verses: “That which is called the restraint of speech

source: །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པ་ཡིས།
en: Is the restraint of speech through which

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་ཆོས་ཀུན་ལ། །ཐོགས་པ་མེད་པར་གདོན་མི་ཟ་བར་འགྱུར།
en: The bodhisattvas will attain the unimpeded knowledge Of the entirety of the Dharma. {57}

source: །དེ་ནི་ངག་གི་སྡོམ་པ་དེ་ཞེས་བྱ།
en: “That which is called the restraint of speech

source: །ངག་གི་སྡོམ་པ་གང་གིས་བློ་ལྡན་རྣམས།
en: Is the restraint of speech through which the wise Attain the unimpeded, inconceivable buddha speech

source: །དེ་ནི་ཡན་ལག་དྲུག་ཅུ་མཚུངས་ལྡན་པ། །ཐོགས་མེད་བསམ་ཡས་སངས་རྒྱས་དབྱངས་ཐོབ་པ།
en: That has sixty aspects. {i}

source: །སྟོབས་བཅུ་དང་ནི་མ་འདྲེས་སངས་རྒྱས་ཆོས། །སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་ཐོབ་འགྱུར་བ།
en: The ten strengths, and the distinct qualities of a buddha. {58}

source: །གང་སྔར་འདི་ལས་ངས་ནི་བརྗོད་པ་ཡི། །སངས་རྒྱས་ཆོས་ཀྱང་ཐམས་ཅད་ཐོབ་འགྱུར་བ།
en: That have previously been taught by me. {59}

source: །གནས་པ་དང་ནི་སོ་སོ་ཡང་དག་རིག །ཤིན་ཏུ་རྨད་བྱུང་ཆོས་ནི་བསམ་ཡས་འཐོབ།
en: Attain the brahmavihāras, the discernments, And marvelous, inconceivable qualities. {60}

source: །དྲན་པ་ཉེར་གཞག་ཡང་དག་སྤོང་བ་དང་། །དེ་བཞིན་རྫུ་འཕྲུལ་རྐང་དང་དབང་སྟོབས་འཐོབ།
en: Attain the mindfulnesses, the correct exertions, The strengths, the powers, and the bases for miraculous powers. {61}

source: །བཏང་སྙོམས་ཆེན་པོ་འཇིགས་པ་མེད་པ་དང་། །སྙིང་རྗེ་ཆེན་པོ་དག་པའི་གནས་པ་འཐོབ།
en: Attain great equanimity, the fearlessnesses, And the state of great compassion. {62}

source: །བདེ་བའི་རྣམ་རྟོག་རྣམ་པར་དག་པ་དང་། །དེ་བཞིན་རྣམ་རྟོག་རབ་དབེན་ཞི་བ་འཐོབ།
en: Attain pure, easeful examination And the peace of being devoid of examination. {63}

source: །བརྫུན་དག་དང་ནི་ཕྲ་མའི་ཚིག་མི་སྨྲ།
en: Do not lie, speak words of slander,

source: །ཁྱལ་པའི་ཚིག་དང་ཚིག་རྩུབ་མི་སྨྲ་བ།
en: Indulge in idle talk, or speak harsh words. {64}

source: །ནམ་ཡང་དམ་པའི་ཆོས་ལ་སྤོང་མི་བྱེད།
en: Will never say that they forsake the Dharma

source: །སངས་རྒྱས་དགེ་འདུན་དག་ཀྱང་མི་སྤོང་བ།
en: Or forsake the Buddha or the Saṅgha. {65}

source: །ཕ་དང་མ་དང་སློབ་དཔོན་དག་གི་ཡང་། །མདུན་དུ་མི་བདེན་ཚིག་རྣམས་མི་སྨྲ་བ།
en: In front of their parents or teachers. {66}

source: །ཚིག་གཞན་གང་དག་སྐྱོན་དང་ལྡན་པ་རྣམས།
en: Desist from all other words

source: །དེ་དག་མ་ལུས་པར་ཡང་སྤོང་བར་འགྱུར།
en: That are harmful, without exception. {67}

source: །ཚིག་རྣམས་ཀྱང་ནི་བྲག་ཅ་འདྲ་བ་དང་། །རྨི་ལམ་ལྟ་བུར་འཇིགས་པ་མེད་པར་འཇུག །དེ་ནི་ངག་གི་སྡོམ་པ་དེ་ཞེས་བྱ།
en: Fearlessly use words that are like echoes And that are analogous to dreams. {68} “That which is called the restraint of speech Is the bodhisattva’s use of words

source: །བདག་མེད་སྲོག་མེད་གཡོ་བ་མེད་པ་དང་། །རྐྱེན་ལས་སྐྱེས་པ་རྨི་ལམ་སླུ་བ་བཞིན།
en: As being without self, without a soul, unmoving, Arising through conditions, and as deceptive as a dream. {69}

source: །ཚིག་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་འཇུག་པ། །དེ་ནི་ངག་གི་སྡོམ་པ་དེ་ཞེས་བྱ།
en: “That which is called the restraint of speech Is the bodhisattva’s use of words,

source: །འགོག་པ་རྟག་ཏུ་རྨི་ལམ་ཇི་བཞིན་ཏེ།
en: With cessation always being like a dream,

source: །མྱ་ངན་འདས་པའང་རྨི་ལམ་ཇི་བཞིན་དུ། །ཚིག་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་འཇུག་པ།
en: And nirvāṇa also being like a dream. {70}

source: །ཚིག་ནི་གང་ཡང་རྙེད་པར་མི་འགྱུར་ཏེ།
en: Is when there are no words at all to be found.

source: །རྟོག་པར་མི་བྱེད་རློམ་སེམས་དེ་མི་བྱེད།
en: It is not conceptualizing them or being proud of them,

source: །ནམ་ཡང་མི་ལྟ་ཆགས་པར་མི་བྱེད་དེ།
en: And not being dependent on them or attached to them.” {71}

source: །དེ་ནི་ངག་གི་སྡོམ་པ་དེ་ཞེས་བྱ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ཡིད་ཀྱི་སྡོམ་པས་བསྡམ་པར་བྱའོ་ཞེས་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Then the Bhagavān said to Candraprabha, “Therefore, young man, you should train by thinking, ‘I shall be endowed with the restraint of the mind.’

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཆོས་འཇིགས་པ་མེད་པ་རྣམས་དང་། མི་འཁྲུགས་པའི་སེམས་རྣམ་པར་གྲོལ་བ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Young man, what is the restraint of the mind? Bodhisattva mahāsattvas who have the restraint of the mind are without fear of the Dharma of the buddhas, and have attained the unshakable, liberated mind. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind obtain the samādhi that is like a vajra. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབར་བའི་བྱེ་བྲག་དང་འདྲ་བ་ཞེས་བྱ་བའི་འོད་ཟེར་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind obtain the light rays that are called as bright as flames. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the perfect voice of a buddha, which has sixty aspects. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚིག་བཙུན་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind have the attainment of noble words. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the thirty-two primary signs of a great being. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the eighty secondary signs of a great being. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་འཐོབ་པ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the ten strengths of a tathāgata, the four fearlessnesses, and the eighteen distinct qualities of a buddha. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་འཐོབ་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the three doorways to liberation. What are the three doorways to liberation?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་འདི་གསུམ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are emptiness, the absence of attributes, and the absence of aspiration. They attain those three doorways to liberation. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚངས་པའི་གནས་པ་ཆེན་པོ་བཞི་འཐོབ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the four great brahmavihāras. What are the four great brahmavihāras?

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། ཚངས་པའི་གནས་པ་ཆེན་པོ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are great love, great compassion, great joy, and great equanimity. They attain those four great brahmavihāras. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་འཐོབ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the four discernments. What are the four discernments?

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are the discernment of meaning, the discernment of phenomena, the discernment of definitions, and the discernment of eloquence. They attain those four discernments. Young man, that is the restraint of the mind.

source: ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་འཐོབ་པ་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the thirty-seven aspects of enlightenment. What are the thirty-seven aspects of enlightenment? They are the four kinds of mindfulness, the four correct exertions, the four bases for miraculous powers, the five powers, the five strengths, the seven aspects of enlightenment, and the noble eightfold path. They attain those thirty-seven aspects of enlightenment. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་འཐོབ་པ་དང་། བཏང་སྙོམས་ཆེན་པོ་ལ་གནས་པ་འཐོབ་པ་དང་། བདེ་བའི་རྣམ་པར་རྟོག་པ་འཐོབ་པ་དང་། རབ་ཏུ་དབེན་པའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain the state of great compassion, attain the state of great equanimity, and attain easeful examination and the quality of being devoid of examination. Young man, that is the restraint of the mind.

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕན་པར་འདོད་པ་དང་། སྤྱོད་པ་དང་། འཇུག་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ། །གཞན་ཡང་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱ་བ་དེ་ནི།
en: “Bodhisattva mahāsattvas who have the restraint of the mind attain engagement in conduct with the wish to benefit others. Young man, that is the restraint of the mind.

source: ཡིད་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལོག་པར་ལྟ་བ་སྤངས་པའི་ཕྱིར་ལོག་པར་ལྟ་བ་དང་འགྲོགས་པར་མི་བྱེད།
en: “Bodhisattva mahāsattvas who have the restraint of the mind do not associate with wrong views in order to desist from wrong views;

source: བརྣབ་སེམས་སྤངས་པའི་ཕྱིར་བརྣབ་སེམས་དང་འགྲོགས་པར་མི་བྱེད།
en: they do not associate with avarice in order to desist from avarice;

source: གནོད་སེམས་སྤངས་པའི་ཕྱིར་གནོད་སེམས་དང་འགྲོགས་པར་མི་བྱེད།
en: they do not associate with malice in order to desist from malice;

source: ལེ་ལོ་སྤངས་པའི་ཕྱིར་ལེ་ལོའི་སེམས་དང་འགྲོགས་པར་མི་བྱེད།
en: they do not associate with laziness in order to desist from laziness;

source: བླ་མ་རྣམས་དང་། ཕ་མ་དང་སློབ་དཔོན་དག་ལ་གཡོའི་སེམས་མི་སྐྱེད།
en: they do not wish to deceive their parents or their teachers;

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་སེམས་མི་སྐྱེད་ཅིང་དེ་དག་དང་འགྲོགས་པར་མི་བྱེད།
en: and they do not develop desire, anger, or ignorance and do not associate with them.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་གཏོང་། ལྷག་པའི་སེམས་ཀྱང་འཁྲུགས་པར་མི་བྱེད་ཅིང་གཞན་ཡང་ཉེས་པ་དང་ལྡན་པའི་ཡིད་ཀྱི་རྟོགས་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་སྤོང་ཞིང་དེ་དག་དང་མི་འགྲོགས་ཏེ།
en: They do not abandon the aspiration to enlightenment, they do not destabilize their superior aspiration, and also the bodhisattvas desist from all other harmful thoughts in their minds, and do not associate with them.

source: དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: Young man, that is the restraint of the mind.

source: །ཡིད་དེ་ཡང་སྒྱུ་མ་ལྟ་བུའོ་ཞེས་བྱ་བ་ལ་འཇུག་གོ། །རྨི་ལམ་ལྟ་བུའོ་ཞེས་བྱ་བ་དང་། སྨིག་རྒྱུ་ལྟ་བུའོ་ཞེས་བྱ་བ་དང་། སྤྲུལ་པ་ལྟ་བུའོ་ཞེས་བྱ་བ་དང་། མིག་ཡོར་ལྟ་བུའོ་ཞེས་བྱ་བ་ལ་འཇུག་སྟེ། གང་ནས་ཀྱང་མ་འོངས་པ་དང་གང་དུ་ཡང་མི་འགྲོ་བར་འཇུག་གོ། །བདེ་བ་ལ་རྨི་ལམ་ལྟ་བུར་འཇུག་གོ། །རྨི་ལམ་ལྟ་བུར་མི་རྟག་པར་འཇུག་གོ།
en: “They perceive the mind as being like a dream, being like a mirage, being like an apparition, and being like a hallucination, something that does not come from anywhere and does not go anywhere.

source: །རྨི་ལམ་ལྟ་བུར་བདག་མེད་པར་འཇུག་གོ། །རྨི་ལམ་ལྟ་བུར་སྲོག་མེད་པར་འཇུག་གོ། །རྨི་ལམ་ལྟ་བུར་སྟོང་པར་འཇུག་སྟེ། ཡིད་དེ་ཡང་མི་དམིགས། མི་རྟོག །རློམ་སེམས་སུ་མི་བྱེད།
en: They perceive happiness as being like a dream, perceive it as being impermanent like a dream, perceive it as being devoid of self like a dream, perceive it as being devoid of a soul like a dream, and they do not objectify it, conceptualize it, become proud of it, view it, or become attached to it.

source: མི་ལྟ། མངོན་པར་མི་ཆགས་ཏེ། གཞོན་ནུ་དེ་ནི་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: Young man, that is the restraint of the mind.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ཡིད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then the Bhagavān said to Candraprabha, “Young man, you should train by thinking, ‘I will practice completely pure conduct of the mind in that way.’ Why is that?

source: གཞོན་ནུ་ཡིད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མི་ཁོམ་པ་ཐམས་ཅད་རྣམ་པར་སྤོང་ཞིང་། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོབ་པར་འགྱུར་རོ།
en: Young man, bodhisattva mahāsattvas who have completely pure conduct of the mind avoid all unfavorable conditions and obtain the countless Dharma teachings of the buddhas.

source: །སངས་རྒྱས་ཐམས་ཅད་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་། མི་འཁྲུགས་པའི་སེམས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They obtain from all the buddhas the higher cognitions of the buddhas and the unshakable, liberated mind. Young man, that is the restraint of the mind.”

source: །ཡིད་ཀྱི་སྡོམ་པ་དག་ནི་ངས་བཤད་ཀྱིས། །གཡེང་བ་མེད་པའི་ཡིད་ཀྱིས་ཐམས་ཅད་ཉོན།
en: “All of you listen with an unwavering mind, For I will teach the restraint of the mind.

source: །ཇི་སྟེ་མྱུར་དུ་འཚང་རྒྱ་འདོད་ན་ཡང་།
en: If you wish to attain buddhahood quickly,

source: །ང་ལས་ཐོས་ནས་དེ་ལ་ནན་ཏན་བྱོས།
en: Listen to me and then practice this. {72}

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །མཆོག་ཏུ་རབ་ཞི་རྒྱ་ཆེ་མི་གཡོ་བ།
en: “That restraint of the mind through which wise ones Attain the vast, unshakable, supreme peace,

source: །རྒྱལ་ཆོས་བསམ་ཡས་རྨད་དུ་བྱུང་བ་འཐོབ།
en: The wonderful, inconceivable Dharma of the jinas,

source: །འདི་ནི་ཡིད་ཀྱི་སྡོམ་པ་དག་པར་བརྗོད།
en: That is what is called the pure restraint of the mind. {73}

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །སེམས་ཀྱང་རྣམ་གྲོལ་རྟག་ཏུ་མི་གཡོ་འཐོབ།
en: “That restraint of the mind through which wise ones Attain the liberated, eternally unshakable mind,

source: །དེ་བཞིན་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་འཛིན་མཆོག །འདི་ནི་ཡིད་ཀྱི་སྡོམ་པ་དག་པར་བརྗོད།
en: And likewise the supreme samādhi that is like a vajra, That is what is called the most splendid restraint of the mind. {74}

source: །མཁས་པ་གང་གིས་ཉེ་བར་སྤྱོད་པ་ཡི།
en: “That which wise ones practice and through which

source: །འོད་ཟེར་དོན་ཆེན་བྱེད་པ་སྒྲུབ་པར་བྱེད།
en: They accomplish light rays of great benefit,

source: །གང་གིས་ཡན་ལག་དྲུག་ཅུའི་དབྱངས་ཐོབ་པ།
en: And attain the voice with sixty aspects,

source: །དེ་ནི་ཡིད་ཀྱི་སྡོམ་པ་རྣམ་དག་བརྗོད།
en: That is what is called the purest restraint of the mind. {75}

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་མྱུར་ཐོབ་འགྱུར།
en: “That restraint of the mind through which wise ones Quickly attain the thirty-two primary signs

source: །སྟོབས་བཅུ་སངས་རྒྱས་ཡོན་ཏན་མ་ལུས་འཐོབ།
en: And attain the ten strengths and every quality of buddhahood,

source: །དེ་ནི་ཡིད་ཀྱི་སྡོམ་པ་མཆོག་ཏུ་བརྗོད།
en: That is what is called the supreme restraint of the mind. {76}

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །སོ་སོ་ཡང་དག་རིག་དང་མི་འཇིགས་དང་། །ཡོན་ཏན་མཆོག་ཏུ་རྨད་བྱུང་བསམ་ཡས་འཐོབ།
en: “That restraint of the mind through which wise ones Attain the discernments and the fearlessnesses, And wonderful, inconceivable, supreme qualities,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །དྲན་པ་ཉེ་བར་གཞག་དང་རྫུ་འཕྲུལ་རྐང་།
en: “That restraint of the mind through which wise ones Attain the mindfulnesses, the bases of miraculous powers,

source: །ཡང་དག་སྤོང་དང་དབང་སྟོབས་ལྔ་འཐོབ་པ།
en: The correct efforts, and the five powers and strengths,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །ཚངས་པའི་གནས་བཞི་མ་ལུས་དེ་བཞིན་ཏེ།
en: “That restraint of the mind through which wise ones Attain all of the four brahmavihāras, and likewise

source: །སྟོང་ཉིད་མཚན་མེད་སྨོན་མེད་སྒོ་འཐོབ་པ།
en: Emptiness, the absence of attributes, and the absence of aspiration,

source: །དེ་ནི་ཡིད་ཀྱི་སྡོམ་པའི་མཆོག་ཏུ་བརྗོད།
en: That is what is called the supreme restraint of the mind. {i}

source: །ཡིད་ཀྱི་སྡོམ་པ་དག་དང་གང་ལྡན་པ།
en: “That restraint of the mind through which wise ones

source: །སྙིང་རྗེ་གནས་དང་བཏང་སྙོམས་ཆེན་པོ་དང་། །སྤྱོད་འཇུག་བྱམས་པ་ཆེན་པོ་ཞི་བ་འཐོབ།
en: Attain the state of compassion, great equanimity, And the practice of correct conduct, great love, and peace,

source: །སྲིད་པ་ཀུན་ལ་དེ་ནི་ཕན་སེམས་འགྱུར།
en: That is what is called the supreme restraint of the mind. {ii}

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །བྱང་ཆུབ་ཡན་ལག་བདུན་ཡང་མྱུར་འཐོབ་ཅིང་།
en: “That restraint of the mind through which wise ones Quickly attain the seven limbs of enlightenment

source: །ལམ་མཆོག་ཡན་ལག་བརྒྱད་པ་དེ་བཞིན་ཏེ།
en: And similarly the eight aspects of the supreme path,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །བཏང་སྙོམས་ཆེ་ལ་གནས་པ་དམ་པ་དང་། །སྙིང་རྗེ་གནས་མཆོག་དྲི་མ་མེད་པ་འཐོབ།
en: “That restraint of the mind through which wise ones Attain the supreme state of equanimity And the stainless, supreme state of compassion,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་གིས་མཁས་པ་དག །བདེ་བའི་རྣམ་རྟོག་ཞི་བ་དག་པའི་ཡིད།
en: “That restraint of the mind through which wise ones Attain easeful examination, a mind of pure peace,

source: །ཡོན་ཏན་ཕྱུག་པས་རབ་ཏུ་དབེན་ཐོབ་པ།
en: And detachment through a wealth of qualities,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་ལྡན་མཁས་པ་དག །ལོག་པའི་ལྟ་བ་ཕན་དང་མི་འགྲོགས་ཤིང་།
en: “That restraint of the mind through which wise ones Do not associate with evil people and those with wrong views,

source: །གནོད་སེམས་བརྣབ་སེམས་སྐྱེད་པར་མི་བྱེད་པ།
en: And do not develop a mind of malice, or a mind of avarice,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་ལྡན་མཁས་པ་དག །སྐད་ཅིག་ཙམ་ཡང་ཚུལ་འཆོས་མི་བྱེད་ཅིང་།
en: “That restraint of the mind through which wise ones Do not act with pretense for even an instant,

source: །བླ་མ་ལ་ཡང་གཡོ་སྒྱུ་མི་བྱེད་དེ།
en: And do not act with deception toward the guru,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་ལྡན་མཁས་པ་དག །འདོད་ཆགས་ཞེ་སྡང་ཡིད་ནི་སྐྱེད་མི་བྱེད།
en: “That restraint of the mind through which wise ones Do not develop desire or anger in their minds,

source: །དེ་བཞིན་གང་དུའང་གཏི་མུག་མི་སྐྱེད་དེ།
en: And similarly never give rise to ignorance,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་ལྡན་མཁས་པ་དག །བྱང་ཆུབ་ལས་ནི་སེམས་ཀྱང་མི་གཏོང་ཞིང་།
en: “That restraint of the mind through which wise ones In their minds do not forsake enlightenment,

source: །ལྷག་པའི་བསམ་པ་དག་ཀྱང་འཁྲུག་མི་བྱེད།
en: And whose superior motivation is never shaken,

source: །ཡིད་ཀྱི་སྡོམ་པ་གང་ལྡན་མཁས་པ་དག །ཡིད་ཀྱི་ཉེས་པ་མང་པོ་ཇི་སྙེད་གཞན། །ཀུན་དང་ལྷན་ཅིག་གནས་པར་མི་བྱེད་པ།
en: “That restraint of the mind through which wise ones Do not keep with any of the other numerous faults Of the mind that there may be,

source: །ཡིད་ལ་སྒྱུ་མ་ལྟ་བུར་འཇུག་བྱེད་དེ།
en: “They understand the mind as being like an illusion,

source: །རྨི་ལམ་འདྲ་ཞིང་དེ་བཞིན་སྨིག་རྒྱུ་འདྲ།
en: Like a dream, and similarly like a mirage,

source: །རྟག་ཏུ་མིག་ཡོར་གྱི་ནི་མཚན་ཉིད་དེ།
en: Always having the characteristic of a hallucination:

source: །བདེ་བ་རྨི་ལམ་ལྟ་བུར་འཇུག་བྱེད་དེ།
en: “They understand happiness to be like a dream,

source: །དེ་བཞིན་མི་རྟག་སྟོང་པ་ཐེར་ཟུག་མུན།
en: And similarly, impermanent, empty, and transient.

source: །ཡིད་ལ་དེ་ལྟར་མཁས་པ་འཇུག་པར་བྱེད།
en: Wise ones understand the mind in that way:

source: །ཡིད་ལ་སྲོག་དང་སེམས་ཅན་མེད་པར་འཇུག །རྐྱེན་ལས་བྱུང་བ་མགལ་མེ་བསྐོར་བ་བཞིན།
en: “They understand the mind to be without a soul, without being, And arising from conditions like a whirled torch’s circle of fire,

source: །ག་ལས་མ་འོངས་གང་དུ་མི་འགྲོ་སྟེ།
en: Not coming from anywhere nor going anywhere:

source: །ཡིད་དེ་གང་ནའང་ཉེ་བར་མི་དམིགས་ཤིང་།
en: “They never objectify the mind at all,

source: །རྟོག་པ་མེད་པར་རློམ་སེམས་མི་བྱེད་དེ།
en: And are without conceptualization or pride;

source: །དེ་ཡང་མི་ལྟ་མངོན་པར་ཞེན་མི་བྱེད།
en: They do not fixate upon it or become attached to it:

source: །དོན་དམ་བདེན་པ་རྨི་ལམ་འདྲ་བ་དང་། །མྱ་ངན་འདས་པ་རྨི་ལམ་མཚུངས་པར་འཇུག །གང་གིས་མཁས་པ་དེ་ལྟར་འཇུག་པ་ཡང་།
en: “They understand the ultimate truth to be like a dream, And nirvāṇa to be the same as a dream; Wise ones understand the mind in that way:

source: །དེ་ནི་ཡིད་ཀྱི་སྡོམ་པའི་མཆོག་ཏུ་བརྗོད།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བཅྭ་ལྔ་པ་སྟེ་ཐ་མ།
en: That is what is called the supreme restraint of the mind.” {91} Conclusion of the thirty-ninth chapter, “Restraint of the Body, Speech, and Mind.” [Untitled] Chapter 40

source: གཞོན་ནུ་དེ་ལ་ལས་ཡོངས་སུ་དག་པ་ནི་འདི་ལྟ་སྟེ།
en: “Young man, what is purity of action?

source: སྲིད་པ་གསུམ་རྨི་ལམ་ལྟ་བུར་མཐོང་ནས་དེ་ལ་འདོད་ཆགས་དང་བྲལ་བ་སྐྱེད་དེ།
en: Seeing the three existences as being like a dream and becoming free of desire.

source: གཞོན་ནུ་འདི་ནི་ལས་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ།
en: Young man, that is purity of action.

source: །གཞོན་ནུ་དེ་ལ་དམིགས་པ་ལས་ཡང་དག་པར་འདའ་བ་གང་ཞེ་ན།
en: “Young man, what is the transcendence of the mind’s fixation on perceptions?

source: འདི་ལྟ་སྟེ། ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་སྒྱུ་མ་ལྟ་བུར་རིག་ནས་དེ་དག་འདོར་བ་སྟེ།
en: It is knowing that the skandhas, dhātus, and āyatanas are like illusions, and renouncing them.

source: འདི་ནི་དམིགས་པ་ལས་ཡང་དག་པར་འདའ་བ་ཞེས་བྱའོ།
en: That is the transcendence of the mind’s fixation on perceptions.

source: །དེ་ལ་ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of the skandhas?

source: ཕུང་པོ་རྣམས་ལ་སྨིག་རྒྱུ་ལྟ་བུར་འཇུག་པའོ།
en: It is perceiving the skandhas to be like mirages.

source: །དེ་ལ་ཁམས་མཉམ་པ་ཉིད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the equality of the dhātus?

source: ཁམས་རྣམས་སྤྲུལ་པ་ལྟ་བུར་ངེས་པར་སྤོང་བའོ།
en: It is renouncing the dhātus as being like apparitions.

source: །དེ་ལ་སྐྱེ་མཆེད་སེལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the elimination of the āyatanas?

source: སྐྱེ་མཆེད་མིག་ཡོར་ལྟ་བུར་ངེས་པར་སྤོང་བའོ།
en: It is renouncing the āyatanas as being like hallucinations.

source: །དེ་ལ་སྲེད་པ་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་མི་ལྟ་བའོ།
en: “What is the renunciation of craving? It is not fixating on any phenomena. That is the renunciation of craving.

source: །དེ་ལ་སྐྱེ་བ་མེད་པ་མངོན་སུམ་དུ་བྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the direct realization of birthlessness?

source: ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ།
en: It is not having the perception of any phenomena.
